from string import ascii_lowercase as str1
"""
5. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
"""
i = int(input('Введите индекс буквы:\n'))
print(str1[i])